In [2]:
import numpy as np
import pandas as pd

In [3]:
dict1 = {
    "name":['harry', 'rohan', 'skillf', 'subha'],
    "mark":[92, 34, 24, 17],
    "city":['rampur', 'kolkata', 'barelly','balasore']
}

In [4]:
pd.DataFrame(dict1)

     name  mark      city
0   harry    92    rampur
1   rohan    34   kolkata
2  skillf    24   barelly
3   subha    17  balasore